//Общая структура программы

/* 0 блок
Подключение #include
*/
int main(){
/* I блок
Создание голобальгых переменных
*/
int time = 0;

/* II блок
Генирация леса:
    Цикл генирации земли
    Цикл генирации воздуха
    Цикл генирации растений

При генирации создаётся объект соотвествующего класса с случайными параметрами и выстовляется в ячейку.
При генирации растений сначала выбирается случайно класс из (нет растения)/трава/куст
*/
while (true)
{
    time++;

    /* III блок
    Отображение мира спомощью sfml (лучше релизовать функцию в отдельном файле)
    */

    /* IV блок
    Процессы в порядке их "быстроты"
    */
}
};
